In [1]:
%load_ext sql

In [2]:
%sql mysql+mysqlconnector://root:root@localhost/mydb

In [15]:
%%sql
-- Drop tables if they already exist (prevents errors when recreating them)
DROP TABLE IF EXISTS employees;
DROP TABLE IF EXISTS contractors;

-- Creating the employees table
CREATE TABLE employees (
    employee_id INT AUTO_INCREMENT PRIMARY KEY,  -- Unique ID, auto-generated for each employee
    first_name VARCHAR(50),                      -- Employee's first name
    last_name VARCHAR(50),                       -- Employee's last name
    position VARCHAR(50),                        -- Job title or role
    salary DECIMAL(10,2)                         -- Salary stored as a decimal number (2 decimal places)
);

-- Creating the contractors table
CREATE TABLE contractors (
    contractor_id INT AUTO_INCREMENT PRIMARY KEY, -- Unique ID, auto-generated for each contractor
    first_name VARCHAR(50),                       -- Contractor's first name
    last_name VARCHAR(50),                        -- Contractor's last name
    position VARCHAR(50),                         -- Job role or designation
    hourly_rate DECIMAL(10,2)                     -- Payment rate per hour for contractors
);

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [16]:
%%sql
INSERT INTO employees (first_name, last_name, position, salary) VALUES

('Alice', 'Smith', 'Developer', 70000.00),   
('Bob', 'Johnson', 'Developer', 75000.00),
('Charlie', 'Lee', 'Manager', 90000.00);

 * mysql+mysqlconnector://root:***@localhost/mydb
3 rows affected.

[]

In [17]:
%%sql
INSERT INTO contractors (first_name, last_name, position, hourly_rate) VALUES

('Dave', 'Williams', 'Developer', 40.00),   
('Eve', 'Brown', 'Tester', 35.00),
('Bob', 'Johnson', 'Developer', 45.00);

 * mysql+mysqlconnector://root:***@localhost/mydb
3 rows affected.

[]

In [18]:
%%sql
select * from employees;

 * mysql+mysqlconnector://root:***@localhost/mydb
3 rows affected.

[(1, 'Alice', 'Smith', 'Developer', Decimal('70000.00')),
 (2, 'Bob', 'Johnson', 'Developer', Decimal('75000.00')),
 (3, 'Charlie', 'Lee', 'Manager', Decimal('90000.00'))]

In [20]:
%%sql
select * from Contractors;

 * mysql+mysqlconnector://root:***@localhost/mydb
3 rows affected.

[(1, 'Dave', 'Williams', 'Developer', Decimal('40.00')),
 (2, 'Eve', 'Brown', 'Tester', Decimal('35.00')),
 (3, 'Bob', 'Johnson', 'Developer', Decimal('45.00'))]

In [21]:
%%sql
-- UNION combines results from both tables and removes duplicates

SELECT first_name, last_name, position
FROM employees

UNION

SELECT first_name, last_name, position
FROM contractors;

 * mysql+mysqlconnector://root:***@localhost/mydb
5 rows affected.

[('Alice', 'Smith', 'Developer'),
 ('Bob', 'Johnson', 'Developer'),
 ('Charlie', 'Lee', 'Manager'),
 ('Dave', 'Williams', 'Developer'),
 ('Eve', 'Brown', 'Tester')]

In [22]:
%%sql
-- UNION ALL keeps duplicates

SELECT first_name, last_name, position
FROM employees

UNION ALL

SELECT first_name, last_name, position
FROM contractors;

 * mysql+mysqlconnector://root:***@localhost/mydb
6 rows affected.

[('Alice', 'Smith', 'Developer'),
 ('Bob', 'Johnson', 'Developer'),
 ('Charlie', 'Lee', 'Manager'),
 ('Dave', 'Williams', 'Developer'),
 ('Eve', 'Brown', 'Tester'),
 ('Bob', 'Johnson', 'Developer')]

In [25]:
%%sql
-- UNION      → combines results & removes duplicates
-- UNION ALL  → combines results & keeps duplicates

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]